//Задача 1
/**** Взаємодія з користувачем та обробка відповіді ****/

/*
Умова завдання:
Використовуючи конструкцію if...else і prompt, написати код, який буде запитувати 'Яка офіційна назва в JavaScript?'.
Якщо користувач ввів ECMAScript, то відображати alert з реченням 'Правильно!', якщо ні 'Це ECMAScript!'.
*/
//Решение задачи 1
// const prom = prompt('Яка офіційна назва в JavaScript?');
// const vip = 'ECMAScript';

// if (prom.toLocaleLowerCase() === vip.toLocaleLowerCase()) {
//   alert('Правильно!');
// } else {
//   alert('ні, правильна назва ECMAScript!');
// }
// console.log(prom);
// Задача 2
/**** Відображення часу ****/

/*
Умова завдання:
Напиши скрипт для відображення години та хвилин в консолі браузера у вигляді '19 г. 26 хв.'.
Якщо значення змінної рівно '0' то виводити речення '19 г' без хвилин.
*/

// const hours = 0;
// const minutes = 59;
// Решение задачи 2
// if (hours == 0) {
//   console.log(minutes + 'хв.');
// } else if (minutes == 0) {
//   console.log(hours + 'г.');
// } else {
//   console.log(hours + 'г.' + minutes + 'хв.');
// }

// Задача 3
/**** Розгалуження ****/
/*
Умова завдання:
Напиши скрипт, який виводить у консоль рядок "Це позитивне число", якщо в prompt користувач ввів число більше за нуль.
Якщо введено нуль, виводь у консоль рядок "Це нуль". Якщо передали від'ємне число, у консолі має бути рядок "Це від'ємне число".
*/
// const userInput = prompt('Введіть число');
// Решение задачи 3
// if (userInput > 0) {
//   alert('Це позитивне число');
// } else if (userInput < 0) {
//   alert("Це від'ємне число");
// } else {
//   alert('Це нуль');
// }
// console.log(userInput);
// Задача 4
/**** Форматування посилання (endsWith) ****/
/*
Умова завдання:
Напиши скрипт який перевіряє чи закінчується значення змінної link символом /.
Якщо ні, додай до кінця значення link цей символ. Використовуй конструкцію if...else.
*/
// let link = 'https://my-site.com/about/';
// Решение задачи 4
// const link2 = '/';

// if (link.endsWith('/') === true) {
//   console.log(link);
// } else {
//   console.log(link + '/');
// }

// Задача 5
/**** Форматування посилання (includes та логічне «І») ****/
/*
Умова завдання:
Напиши скрипт який перевіряє чи закінчується значення змінної link символом /.
Якщо ні, додай у кінець значення link цей символ, але тільки в тому випадку, якщо в link є підрядок "my-site".
*/

// let link = 'https://my-site.com/about';
// Решение задачи 5
// const link2 = 'my-site';
// const link3 = '/';
// if (link.endsWith('/') === true) {
//   console.log(link);
// } else if (link.includes('my-site') === true) {
//   console.log(link + '/');
// } else {
//   console.log('Операция не выполнена, так как 2 условия не выполнени');
// }
// Задача 6
/**** if...else та логічні оператори ****/
/*
Умова завдання:
Напиши скрипт який виводитиме в консоль браузера рядок залежно від значення змінної hours.
Якщо значення змінної hours:
- менше 17, виводь рядок "Pending"
- більше або рівне 17 і менше або дорівнює 24, виводь рядок "Expires"
- більше 24, виводи рядок "Overdue"
*/
// let hours = 25;
// Решение задачи 6
// первый вариант
// if (i < 17) {
//   console.log('Pending');
// } else if (i >= 17 && i <= 24) {
//   console.log('Expires');
// } else {
//   console.log('Overdue');
// }
//2 вариант
// for (let i = 0; i <= hours; i += 1) {
//   console.log(i);
//   if (i < 17) {
//     console.log('Pending');
//   } else if (i >= 17 && i <= 24) {
//     console.log('Expires');
//   } else {
//     console.log('Overdue');
//   }
// }
// Задача 7
/**** Дедлайн здачі проекту (if...else) ****/

/*
Умова завдання:
Напиши скрипт для відображення часу дедлайн здачі проекту. Використовуй конструкцію if...else.
- Якщо до дедлайну 0 днів - виведи рядок "Сьогодні"
- Якщо до дедлайну 1 день - виведи рядок "Завтра"
- Якщо до дедлайну 2 дні - виведи рядок "Післязавтра"
- Якщо до дедлайну 3+ днів - виведи рядок "Дата в майбутньому"
*/

// const daysUntilDeadline = 2;
// Решение задачи 7
// if (daysUntilDeadline === 0) {
//   console.log('Сьогодні');
// } else if (daysUntilDeadline === 1) {
//   console.log('Завтра');
// } else if (daysUntilDeadline === 2) {
//   console.log('Післязавтра');
// } else {
//   console.log('Дата в майбутньому');
// }

// Задача 8
/**** Дедлайн здачі проекта (switch) ****/
/*
Умова завдання:
Напиши скрипт для відображення часу дедлайн здачі проекту. Використовуй конструкцію switch.
- Якщо до дедлайну 0 днів - виведи рядок "Сьогодні"
- Якщо до дедлайну 1 день - виведи рядок "Завтра"
- Якщо до дедлайну 2 дні - виведи рядок "Післязавтра"
- Якщо до дедлайну 3+ днів - виведи рядок "Дата в майбутньому"
*/
// const daysUntilDeadline = 5;
// Решение задачи 8
// switch (daysUntilDeadline) {
//   case 0:
//     console.log('Сьогодні');
//     break;
//   case 1:
//     console.log('Завтра');
//     break;
//   case 2:
//     console.log('Післязавтра');
//     break;
//   default:
//     console.log('Дата в майбутньому');
// }
// Задача 9
/**** Цикл for ****/
/*
Умова завдання:
Напиши цикл for який виводить у консоль браузера числа за зростанням від min до max, але якщо число кратне 5.
*/
// const max = 100;
// const min = 20;
// Решение задачи 9
// let total = 0;
// for (let i = min; i <= max; i += 1) {
//   if (i % 5 === 0) {
//     total += i;
//     console.log(i);
//   }
// }

// Задача 10
/**** Введення користувача та розгалуження ****/
/*
Умова завдання:
Напиши скрипт, який буде запитувати логін за допомогою prompt і логуватиме результат у консоль браузера.
- Якщо відвідувач вводить "Адмін", то prompt запитує пароль
- Якщо нічого не введено або натиснуто клавішу Esc - вивести рядок "Скасовано"
- В іншому випадку вивести рядок "Я вас не знаю"
Пароль перевіряти так:
- Якщо введено пароль "Я адмін", то вивести рядок "Вітаю!"
- Інакше виводити рядок "Невірний пароль"
*/
// Решение задачи 10
// let prom = prompt('Введіть будь ласка логін');
// let promt;
// const login = 'Admin';
// let password = 'admin';
// if (prom === null) {
//   console.log('Скасовано');
// } else if (prom === login) {
//   promt = prompt('Введіть будь ласка пароль');
//   let total = promt === password ? 'Вітаю!!!' : 'Невірний пароль';
//     console.log(total);
//     // 2 вариант Тернарный оператор
//   //   if (promt === password) {
//   //     console.log('Вітаю!!!');
//   //   } else {
//   //     console.log('Невірний пароль');
//   //   }
// } else {
//   console.log('Я вас не знаю');
// }
